In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('/Users/minguinho/Downloads/데이콘/pandas 입문/Data/data03.csv') 
data # 데이터 불러오기

    도시       인구수        남자        여자
0   서울   9741381   4757642   4984229
1   부산   3416918   1680933   1735985
2   인천   2925967   1472081   1453886
3   대구   2453041   1218326   1234715
4   대전   1525849    765718    760131
5   광주   1496172    745122    751050
6   수원   1193894    601097    592797
7   울산   1147037    589233    557804
8   고양   1068641    523803    544838
9   용인   1061440    526824    534617
10  총합  26030340  12880779  13150052

In [3]:
# 열을 부분적으로 선택
data[2:-2] #뒤에 음수가 있으면 끝에서부터 음수만큼 제외한 위치까지를 표현

   도시      인구수       남자       여자
2  인천  2925967  1472081  1453886
3  대구  2453041  1218326  1234715
4  대전  1525849   765718   760131
5  광주  1496172   745122   751050
6  수원  1193894   601097   592797
7  울산  1147037   589233   557804
8  고양  1068641   523803   544838

In [4]:
data[-2:] # 끝에서 2만큼 제외한 위치에서 시작해 끝까지 == 뒤에 2개

    도시       인구수        남자        여자
9   용인   1061440    526824    534617
10  총합  26030340  12880779  13150052

In [5]:
# 다중 행, 열 선택. loc를 이용. loc는 인덱스를 이용해 접근
data.loc[[0,2,4,6,7,9], ['인구수','남자', '여자']] # 0,2,4,6,7,9 인덱스를 가진 데이터 중 '인구수', '남자', '여자' 데이터만 가져옴

       인구수       남자       여자
0  9741381  4757642  4984229
2  2925967  1472081  1453886
4  1525849   765718   760131
6  1193894   601097   592797
7  1147037   589233   557804
9  1061440   526824   534617

In [6]:
data.loc[2:5, '인구수':'여자'] # 이렇게 범위로 불러내기도 가능. 2~5번 째 열에서 인구수~여자 데이터 불러옴. 행을 넣을 때 도시, 인구수, 남자, 여자 순으로 넣었으니 인구수, 남자, 여자 데이터가 출력됨.

       인구수       남자       여자
2  2925967  1472081  1453886
3  2453041  1218326  1234715
4  1525849   765718   760131
5  1496172   745122   751050

In [7]:
# iloc을 이용해서 데이터에 접근할 수 있다. iloc은 인덱스가 아닌 위치를 이용해 데이터에 접근한다. 이 점 주의하자. 
data.iloc[[2,3,4,5],[1,3]]

       인구수       여자
2  2925967  1453886
3  2453041  1234715
4  1525849   760131
5  1496172   751050

In [8]:
data.iloc[2:5, 1:] # 2~5번 째 행이 아닌 2~4번 째 행의 데이터를 가져온다.

       인구수       남자       여자
2  2925967  1472081  1453886
3  2453041  1218326  1234715
4  1525849   765718   760131

In [9]:
data.iloc[-5:, -3:] # iloc는 인덱스가 아닌 위치로 접근한다. 그러므로 이는 뒤에서 5번 째 행부터 시작, 뒤에서 3번 째 열에서부터 데이터 표시를 시작한다.

         인구수        남자        여자
6    1193894    601097    592797
7    1147037    589233    557804
8    1068641    523803    544838
9    1061440    526824    534617
10  26030340  12880779  13150052

In [19]:
# 대구, 대전, 광주의 인구수, 남자 여자 칼럼을 선택해 저장하기
save_data = data.loc[3:5, ['인구수', '남자', '여자']]

In [20]:
save_data.to_csv('/Users/minguinho/Downloads/데이콘/pandas 입문/Data/data04.csv', index=False)